/*
读题：计算一个整数的二进制数的1的个数

解题思路：

●  从右到左读取二进制数，每读一个判断是否是1（x&1=x, x&0=0），如果是1计数器+1，再右移计算判断下一位
●  方法2

统计 11010010 的1 的个数
分组
11 01 00 10
统计每个分组1的个数
2 1 0 1
分组
21 01
相加
3 1
相加
4

思考：如何把 2 1 0 1 构造出来？
 11010010
&01010101
=01010000

  1101001
&01010101
=01000001

 01010000
+01000001
=10010001
分组
10 01 00 01
2 1 0 1

构造 3 1
 10010001
&00110011
=00010001

   100100
&00110011
=00100000

 00010001
+00100000
=00110001

0011 0001
3 1

构造4
 00110001
&00001111
=00000001

     0011
&00001111
=00000011

 00000001
+00000011
=00000100

4

总结：位操作特性 x&1=x, x&0=0
 */
public class No191 {
    public static int hammingWeight(int n) {
        int count = 0;
        for (int i = 0; i < 32; i++) {
            if ((n&1) == 1) {
                count++;
            }
            n >>= 1;
        }
        return count;
    }

    public static void main(String[] args) {
        System.out.println(hammingWeight(-3));
    }
}
